app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title
---
  def index

  sort = params[:sort] || session[:sort]

  case sort
  when "title"
  @title_header="hilite"
  @date_header=nil

  when "release_date"
  @title_header=nil
  @date_header = "hilite"
  end

  @ratings = params[:ratings] || session[:ratings] || {}

  if params[:sort] != session[:sort]
    session[:sort] = sort
    redirect_to :sort => sort, :ratings => @ratings and return
  end

  if params[:ratings] != session[:ratings] and @ratings != {}
    session[:sort] = sort
    session[:ratings] = @ratings
    redirect_to :sort => sort, :ratings => @ratings and return
  end

  @movies = Movie.order(params[:sort]).find_all_by_rating(@ratings.keys)